package com.company;

/*Создать классы, спецификации которых приведены ниже.
Определить кон-структоры и методы setТип(), getТип(), toString().
Определить дополнительно методы в классе, создающем массив объектов.
Задать критерий выбора данных и вывести эти данные на консоль.
В каждом классе, обладающем информацией, должно быть объявлено несколько конструкторов.
12. Airline: Пункт назначения, Номер рейса, Тип самолета, Время вылета, Дни недели.

        Создать массив объектов. Вывести:

        a) список рейсов для заданного пункта назначения;

        b) список рейсов для заданного дня недели;

        c) список рейсов для заданного дня недели, время вылета для которых больше заданного. */
public enum PlaneType {
     commercial, military

}
